/*
SQLyog 企业版 - MySQL GUI v8.14 
MySQL - 5.5.5-10.11.2-MariaDB : Database - glory
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`glory` /*!40100 DEFAULT CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci */;

USE `glory`;

/*Table structure for table `attorneys` */

DROP TABLE IF EXISTS `attorneys`;

CREATE TABLE `attorneys` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `contact` varchar(255) DEFAULT NULL,
  `lawFirm` int(11) NOT NULL DEFAULT 0,
  `descriptions` varchar(255) DEFAULT NULL,
  `isInactived` tinyint(1) DEFAULT 0,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `attorneys` */

insert  into `attorneys`(`id`,`name`,`contact`,`lawFirm`,`descriptions`,`isInactived`) values (0,'无','',0,NULL,0),(1,'李海孚','57362323',1,NULL,0),(2,'崔瀚文','57362676',2,NULL,0);

/*Table structure for table `auth_levels` */

DROP TABLE IF EXISTS `auth_levels`;

CREATE TABLE `auth_levels` (
  `id` int(11) NOT NULL,
  `descriptions` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `auth_levels` */

insert  into `auth_levels`(`id`,`descriptions`) values (0,'一般'),(1,'主管'),(2,'管理员');

/*Table structure for table `caseAttachments` */

DROP TABLE IF EXISTS `caseAttachments`;

CREATE TABLE `caseAttachments` (
  `id` int(11) NOT NULL,
  `caseNo` varchar(255) NOT NULL,
  `evidenceId` int(11) NOT NULL DEFAULT 0,
  `caseStatus` varchar(100) DEFAULT '0.0',
  `numFile` int(11) NOT NULL DEFAULT 0,
  `numCPage` int(11) NOT NULL DEFAULT 0,
  `numCopy` int(11) NOT NULL DEFAULT 0,
  `numOriginal` int(11) NOT NULL DEFAULT 0,
  `fileLabel` varchar(255) DEFAULT NULL,
  `filePath` varchar(255) DEFAULT NULL,
  `dateUploaded` datetime DEFAULT NULL,
  PRIMARY KEY (`evidenceId`),
  UNIQUE KEY `caseNo` (`caseNo`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `caseAttachments` */

insert  into `caseAttachments`(`id`,`caseNo`,`evidenceId`,`caseStatus`,`numFile`,`numCPage`,`numCopy`,`numOriginal`,`fileLabel`,`filePath`,`dateUploaded`) values (2,'A202311110005',0,'1',2,5,1,1,'审判决书','/1/判决书.pdf','2023-11-01 14:00:00');

/*Table structure for table `caseExcutes` */

DROP TABLE IF EXISTS `caseExcutes`;

CREATE TABLE `caseExcutes` (
  `id` int(11) NOT NULL,
  `excutesId` int(11) NOT NULL DEFAULT 0,
  `caseNo` varchar(255) NOT NULL,
  `subId` int(11) NOT NULL DEFAULT 0,
  `caseStatus` varchar(100) DEFAULT '0.0',
  `personExecuted` varchar(100) DEFAULT NULL,
  `personContact` varchar(16) DEFAULT NULL,
  `targetExecuted` varchar(255) DEFAULT NULL,
  `exexuteAmount` varchar(255) DEFAULT '0.00',
  `sumExecuted` varchar(1000) DEFAULT NULL,
  `dateExecuted` datetime DEFAULT NULL,
  `attachments` varchar(255) DEFAULT NULL,
  UNIQUE KEY `excutesId` (`excutesId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `caseExcutes` */

insert  into `caseExcutes`(`id`,`excutesId`,`caseNo`,`subId`,`caseStatus`,`personExecuted`,`personContact`,`targetExecuted`,`exexuteAmount`,`sumExecuted`,`dateExecuted`,`attachments`) values (2,0,'A202311110005',0,'4.1','张三','18612221231','财产','200','','2023-12-11 14:00:00',''),(2,1,'A202311110005',1,'4.1','张五','1572312534','','34','','2023-12-21 14:00:00','');

/*Table structure for table `caseProperties` */

DROP TABLE IF EXISTS `caseProperties`;

CREATE TABLE `caseProperties` (
  `id` int(11) NOT NULL,
  `propertyId` int(11) NOT NULL DEFAULT 0,
  `caseNo` varchar(255) NOT NULL,
  `subId` int(11) NOT NULL DEFAULT 0,
  `caseStatus` varchar(100) DEFAULT '0.0',
  `propertyName` varchar(255) DEFAULT NULL,
  `propertyStatus` int(11) NOT NULL DEFAULT -1,
  `dateUpdated` datetime DEFAULT NULL,
  `dateOccur` datetime DEFAULT NULL,
  `attachments` varchar(255) DEFAULT NULL,
  UNIQUE KEY `propertyId` (`propertyId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `caseProperties` */

insert  into `caseProperties`(`id`,`propertyId`,`caseNo`,`subId`,`caseStatus`,`propertyName`,`propertyStatus`,`dateUpdated`,`dateOccur`,`attachments`) values (2,0,'A202311110005',0,'4.1','未知',1,'2023-12-01 14:00:00','2023-12-01 14:00:00',NULL);

/*Table structure for table `caseStatus` */

DROP TABLE IF EXISTS `caseStatus`;

CREATE TABLE `caseStatus` (
  `id` int(11) NOT NULL,
  `caseNo` varchar(100) NOT NULL,
  `caseStatus` float NOT NULL DEFAULT -1,
  `legalAgencies` int(11) NOT NULL DEFAULT 0,
  `lawFirm` int(11) NOT NULL DEFAULT 0,
  `attorney` varchar(100) NOT NULL DEFAULT '无0',
  `FirstInstance` datetime DEFAULT NULL,
  `SecondInstance` datetime DEFAULT NULL,
  `legalInstitution` varchar(255) DEFAULT '0',
  `legalCounsel` varchar(255) DEFAULT '0',
  `penalty` varchar(255) DEFAULT '0.00',
  `paidAmount` varchar(255) DEFAULT '0.00',
  PRIMARY KEY (`id`),
  UNIQUE KEY `caseNo` (`caseNo`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `caseStatus` */

insert  into `caseStatus`(`id`,`caseNo`,`caseStatus`,`legalAgencies`,`lawFirm`,`attorney`,`FirstInstance`,`SecondInstance`,`legalInstitution`,`legalCounsel`,`penalty`,`paidAmount`) values (2,'A202311110004',4.1,1,0,'无0','2023-10-01 00:00:00','2023-11-01 00:00:00','1','其他3','400','234'),(27,'A202311110006',2,1,0,'无0','2023-11-01 00:00:00','2023-12-01 00:00:00','1','法官2','0.00','0.00'),(28,'A202311110005',-1,1,1,'君合1,白朗2','2023-11-01 00:00:00','2023-12-01 00:00:00','1','书记员4,法官1','0.00','0.00'),(29,'A2023111100051',2,1,0,'无0','2023-11-01 00:00:00','2023-12-01 00:00:00','1','无0','0.00','0.00'),(40,'(2023)京0115执8433号等',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(41,'(2022)京0101民初13392',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(42,'(2023)京0101执3795号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(43,'(2023)京0115执966号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(44,'(2023)京0115执4228号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(45,'(2022)大预民字63062号、(2023)京0115执5892号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(46,'(2023)京0115执7996号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(47,'(2022)苏0509民初870号，2023-执行1005',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(48,'(2023)京0115执2776号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(49,'(2023)京0115执7065号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(50,'(2021)京0115民初26879号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(51,'(2023)京0115诉前调确1492号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(52,'(2023)京0115民初12661号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(53,'(2023)京74民终433号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(54,'(2023)京0101执恢597号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(55,'(2022)京0115民初16797号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(56,'(2023)京0115民初4132号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(57,'(2023)京0115民初14038号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(58,'(2023)京0115民初12095号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(59,'(2023)京0101民初3580号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(60,'(2023)京0115民初19703号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(61,'2023年大预民字第74006号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(62,'2023年大预民字第76410号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(63,'2023年大预民字第81756号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(64,'(2023)京0115民初21636号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(65,'2023年大预民字第78707号',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(66,'1',2,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(67,'(2023)京0115执8433号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(68,'(2023)京0115执8890号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(69,'(2023)京0115执9206号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(70,'(2023)京0115执9604号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(71,'(2023)京0115执9796号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(72,'(2023)京0115执9830号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(73,'(2023)京0115执3265号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(74,'(2023)京0115执3384号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(75,'(2023)京0115执3572号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(76,'(2022)京0108执9093号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(77,'(2021)京0115执13459号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(78,'(2021)京0115执13458号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(79,'(2021)京0115执13063号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(80,'(2022)京0115执2475号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(81,'(2022)京0115执3124号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(82,'(2022)京0115执3565号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(83,'(2022)京0115执3567号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(84,'(2022)京0115执3569号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(85,'(2022)京0115执3634号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(86,'(2022)京0115执3668号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(87,'(2022)京0115执3696号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(88,'(2022)京0115执3789号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(89,'(2022)京0115执3923号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(90,'(2022)京0115执3957号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(91,'(2022)京0115执3979号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(92,'(2022)京0115执3977号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(93,'(2022)京0115执4071号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(94,'(2022)京0115执4068号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(95,'(2022)京0115执4067号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(96,'(2022)京0115执4115号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(97,'(2022)京0115执4073号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(98,'(2022)京0115执4072号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(99,'(2022)京0115执4133号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(100,'(2022)京0115执4129号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(101,'(2022)京0115执4306号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(102,'(2022)京0115执4202号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(103,'(2022)京0115执4076号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(104,'(2022)京0115执4102号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(105,'(2022)京0115执4312号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(106,'(2022)京0115执4214号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(107,'(2022)京0115执4392号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(108,'(2022)京0115执4087号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(109,'(2022)京0115执4255号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(110,'(2022)京0115执4239号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(111,'(2022)京0115执4296号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(112,'(2022)京0115执4432号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(113,'(2022)京0115执4490号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(114,'(2022)京0115执4516号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(115,'(2022)京0115执4507号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(116,'(2022)京0115执4506号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(117,'(2022)京0115执4505号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(118,'(2022)京0115执4504号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(119,'(2022)京0115执4277号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(120,'(2022)京0115执4498号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(121,'(2022)京0115执4591号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(122,'(2022)京0115执4808号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(123,'(2022)京0115执4860号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(124,'(2022)京0115执4863号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(125,'(2022)京0115执5020号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(126,'(2022)京0115执5064号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(127,'(2022)京0115执5262号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(128,'(2022)京0115执5367号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(129,'(2022)京0115执5466号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(130,'(2022)京0115执5469号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(131,'(2022)京0115执5506号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(132,'(2022)京0115执5643号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(133,'(2022)京0115执5731号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(134,'(2022)京0115执5723号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(135,'(2022)京0115执5914号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(136,'(2022)京0115执5959号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(137,'(2022)京0115执6013号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(138,'(2022)京0115执7707号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(139,'(2022)京0115执7785号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(140,'(2022)京0115执7718号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00'),(141,'(2022)京0115执7971号',4.1,0,0,'无0','0000-00-00 00:00:00','0000-00-00 00:00:00','0','0','0.00','0.00');

/*Table structure for table `caseUpdates` */

DROP TABLE IF EXISTS `caseUpdates`;

CREATE TABLE `caseUpdates` (
  `id` int(11) NOT NULL,
  `updatesId` int(11) NOT NULL DEFAULT 0,
  `caseNo` varchar(255) NOT NULL,
  `subId` int(11) NOT NULL DEFAULT 0,
  `caseStatus` varchar(100) DEFAULT '0.0',
  `updateDetails` varchar(255) DEFAULT NULL,
  `dateOccur` datetime DEFAULT NULL,
  `dateUpdated` datetime DEFAULT NULL,
  `caseDisputed` varchar(255) DEFAULT NULL,
  `attachments` varchar(255) DEFAULT NULL,
  UNIQUE KEY `updatesId` (`updatesId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `caseUpdates` */

insert  into `caseUpdates`(`id`,`updatesId`,`caseNo`,`subId`,`caseStatus`,`updateDetails`,`dateOccur`,`dateUpdated`,`caseDisputed`,`attachments`) values (2,0,'A202311110005',0,'1','23.9.28送达一审判决书','2023-09-28 14:00:00','2023-11-01 14:00:00','','0'),(2,1,'A202311110005',1,'1','23.10.13送达判决书','2023-10-13 14:00:00','2023-11-02 14:00:00','',''),(2,2,'A202311110005',0,'2','23.10.28送达二审判决书','2023-10-28 14:00:00','2023-12-01 14:00:00','','');

/*Table structure for table `case_catelogs` */

DROP TABLE IF EXISTS `case_catelogs`;

CREATE TABLE `case_catelogs` (
  `id` int(11) NOT NULL,
  `label` varchar(255) DEFAULT NULL,
  `descriptions` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `case_catelogs` */

insert  into `case_catelogs`(`id`,`label`,`descriptions`) values (0,'诉讼',NULL),(1,'仲裁',NULL);

/*Table structure for table `case_causes` */

DROP TABLE IF EXISTS `case_causes`;

CREATE TABLE `case_causes` (
  `id` int(11) NOT NULL,
  `label` varchar(255) DEFAULT NULL,
  `descriptions` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `case_causes` */

insert  into `case_causes`(`id`,`label`,`descriptions`) values (0,'购房合同纠纷',NULL),(1,'建设工程纠纷',NULL),(2,'佣金类纠纷',NULL),(3,'断供担保纠纷',NULL),(4,'断供担保纠纷',NULL),(5,'断供追偿纠纷',NULL),(6,'劳动争议纠纷',NULL),(7,'金融借款纠纷',NULL),(8,'行政诉讼',NULL),(9,'民间借贷纠纷',NULL),(10,'房屋租赁合同纠纷',NULL),(11,'拆迁安置纠纷',NULL),(12,'服务合同纠纷',NULL),(13,'物业服务合同纠纷',NULL),(14,'车位使用权转让纠纷',NULL),(15,'股权转让纠纷',NULL),(16,'侵权纠纷',NULL),(17,'建筑物区分所有权',NULL),(18,'案外人执行异议之诉',NULL),(19,'票据追索权纠纷',NULL);

/*Table structure for table `case_labels` */

DROP TABLE IF EXISTS `case_labels`;

CREATE TABLE `case_labels` (
  `id` int(11) NOT NULL,
  `label` varchar(255) DEFAULT NULL,
  `labelStyle` varchar(255) DEFAULT NULL,
  `descriptions` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `case_labels` */

insert  into `case_labels`(`id`,`label`,`labelStyle`,`descriptions`) values (0,'普通案件','{\"background\":\"skyblue\",\"text-shadow\":\"none\",\"text-align\":\"center\",\"font-weight\":\"700\"}',NULL),(1,'重大案件300万以上','{\"background\":\"orange\",\"color\":\"white\",\"text-shadow\":\"none\",\"text-align\":\"center\",\"font-weight\":\"700\"}',NULL),(2,'重大案件1000万以上','{\"background\":\"#E25C62\",\"color\":\"white\",\"text-shadow\":\"none\",\"text-align\":\"center\",\"font-weight\":\"700\"}',NULL),(3,'重大案件 群诉','{\"background\":\"blue\",\"color\":\"white\",\"text-shadow\":\"none\",\"text-align\":\"center\",\"font-weight\":\"700\"}',NULL);

/*Table structure for table `case_reasons` */

DROP TABLE IF EXISTS `case_reasons`;

CREATE TABLE `case_reasons` (
  `id` int(11) NOT NULL,
  `label` varchar(255) DEFAULT NULL,
  `descriptions` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `case_reasons` */

insert  into `case_reasons`(`id`,`label`,`descriptions`) values (0,'逾期交付',NULL),(1,'逾期办证',NULL),(2,'捆绑销售',NULL),(3,'逾期付款',NULL),(4,'断供担保',NULL),(5,'断供追偿',NULL),(6,'执行异议',NULL);

/*Table structure for table `case_status` */

DROP TABLE IF EXISTS `case_status`;

CREATE TABLE `case_status` (
  `id` float NOT NULL,
  `isMain` int(1) DEFAULT 1,
  `name` varchar(255) DEFAULT NULL,
  `descriptions` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `case_status` */

insert  into `case_status`(`id`,`isMain`,`name`,`descriptions`) values (0,1,'一审',NULL),(1,1,'二审',NULL),(2,1,'执行',NULL),(3,0,'强制执行',NULL),(3.1,0,'正常执行',NULL),(3.2,0,'未执行',NULL),(4,1,'结案',NULL),(5,1,'再审',NULL),(6,1,'监督',NULL);

/*Table structure for table `case_types` */

DROP TABLE IF EXISTS `case_types`;

CREATE TABLE `case_types` (
  `id` int(11) NOT NULL,
  `label` varchar(255) DEFAULT NULL,
  `descriptions` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `case_types` */

insert  into `case_types`(`id`,`label`,`descriptions`) values (0,'被诉',NULL),(1,'主诉',NULL);

/*Table structure for table `cases` */

DROP TABLE IF EXISTS `cases`;

CREATE TABLE `cases` (
  `id` int(11) NOT NULL,
  `caseNo` varchar(100) NOT NULL,
  `caseName` varchar(100) NOT NULL,
  `caseLabel` int(2) NOT NULL DEFAULT 0,
  `caseProject` int(2) NOT NULL DEFAULT 0,
  `casePersonnel` varchar(100) NOT NULL,
  `case2ndParty` varchar(100) NOT NULL,
  `caseCatelog` int(2) NOT NULL DEFAULT 0,
  `caseType` int(2) NOT NULL DEFAULT 0,
  `caseCause` int(2) NOT NULL DEFAULT 0,
  `caseDate` datetime NOT NULL,
  `caseReason` int(2) NOT NULL DEFAULT 0,
  `appealAmount` decimal(65,0) DEFAULT NULL,
  `requestAmount` decimal(65,0) DEFAULT NULL,
  `caseCounterclaimRequest` varchar(1000) DEFAULT NULL,
  `caseLawsuitRequest` varchar(1000) DEFAULT NULL,
  `caseSum` varchar(1000) DEFAULT NULL,
  `caseApplicant` varchar(100) NOT NULL,
  `caseCreateDate` datetime NOT NULL,
  `isReadOnly` tinyint(1) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `caseNo` (`caseNo`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `cases` */

insert  into `cases`(`id`,`caseNo`,`caseName`,`caseLabel`,`caseProject`,`casePersonnel`,`case2ndParty`,`caseCatelog`,`caseType`,`caseCause`,`caseDate`,`caseReason`,`appealAmount`,`requestAmount`,`caseCounterclaimRequest`,`caseLawsuitRequest`,`caseSum`,`caseApplicant`,`caseCreateDate`,`isReadOnly`) values (2,'A202311110004','产品商标案件',2,0,'1公司1,3个人0,2个人1','3李四五',0,0,0,'2023-09-30 00:00:00',0,'0','0','','','','8','2023-11-30 00:00:00',0),(27,'A202311110006','管文波离职案件',3,1,'3公司0','3李四是',1,0,2,'2023-11-17 00:00:00',0,NULL,NULL,'','','','8','2023-11-26 00:00:00',1),(28,'A202311110005','管文波离职案件',0,0,'0个人1','2李四',0,1,6,'2023-11-20 00:00:00',0,NULL,NULL,'','','','8','2023-11-20 00:00:00',0),(29,'A2023111100051','管文波离职案件1',0,0,'3公司0,3个人0,2个人1','0李四是',0,0,0,'2023-11-30 00:00:00',0,'0','0','','','','8','2023-11-30 00:00:00',1),(40,'(2023)京0115执8433号等','',3,1,'3公司1','4张韬等',0,0,0,'2023-07-11 00:00:00',0,'0',NULL,'','','逾期交付赔偿','','2023-11-29 00:00:00',0),(41,'(2022)京0101民初13392','',0,1,'3公司1','0中国银行股份有限公司北京崇文支行,3谢鑫晨',0,0,3,'2023-04-22 00:00:00',4,'0',NULL,'','','公积金断供','','2023-11-29 00:00:00',0),(42,'(2023)京0101执3795号','',0,1,'3公司1','0中国银行股份有限公司北京崇文支行,3谢鑫晨',0,0,3,'2023-04-22 00:00:00',4,'0',NULL,'','','商业贷款断供','','2023-11-29 00:00:00',0),(43,'(2023)京0115执966号','',1,1,'3公司1,3公司4','4赵比伦,4郅蒙蒙',0,0,0,'2023-01-08 00:00:00',3,'0',NULL,'','','双方合意解约后，未退房款','','2023-11-29 00:00:00',0),(44,'(2023)京0115执4228号','',0,1,'3公司1','4才胜',0,0,0,'2023-04-02 00:00:00',3,'0',NULL,'','','双方合意解约后，未退房款','','2023-11-29 00:00:00',0),(45,'(2022)大预民字63062号、(2023)京0115执5892号','',0,1,'3公司1','4中铁十四局集团房桥有限公司',0,0,19,'2023-05-07 00:00:00',3,'0',NULL,'','','承兑票据到期拒付','','2023-11-29 00:00:00',0),(46,'(2023)京0115执7996号','',0,1,'3公司1','4中铁十四局集团房桥有限公司',0,0,1,'2023-07-06 00:00:00',3,'0',NULL,'','','调解协议约定的质保金到期未付','','2023-11-29 00:00:00',0),(47,'(2022)苏0509民初870号，2023-执行1005','',0,1,'3公司1','0康力电梯股份有限公司',0,0,1,'2023-12-04 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(48,'(2023)京0115执2776号','',0,1,'3公司1','4遵化市钟馗门业有限公司',0,0,1,'2023-02-12 00:00:00',3,'0',NULL,'','','已结算工程款未支付','','2023-11-29 00:00:00',0),(49,'(2023)京0115执7065号','',0,1,'3公司1','4北京零卡光年广告有限公司',0,0,12,'2023-06-01 00:00:00',3,'0',NULL,'','','调解协议确定服务费未支付','','2023-11-29 00:00:00',0),(50,'(2021)京0115民初26879号','',1,1,'2公司1','0北京东方雨虹防水工程有限公司',0,0,1,'2023-12-04 00:00:00',3,'0',NULL,'','','分包工程因延期付款解除，支付工程款及利息','','2023-11-29 00:00:00',0),(51,'(2023)京0115诉前调确1492号','',0,1,'2公司1','0北京兴盈伟创信息咨询有限公司',0,0,12,'2023-12-04 00:00:00',3,'0',NULL,'','','无争议欠款。调解协议：\r\n1、23.10.31前给付10万、23.11.30前给付10万、23.12.31前给付 10万\r\n2、未按约定付款，可一次性申请强制执行','','2023-11-29 00:00:00',0),(52,'(2023)京0115民初12661号','',0,1,'2公司1','1北京思源鑫业建筑装饰有限公司',0,0,1,'2023-07-03 00:00:00',3,'0',NULL,'','','无争议欠款','','2023-11-29 00:00:00',0),(53,'(2023)京74民终433号','',2,0,'5公司0,6公司1,6公司2','0北京鼎成典当行有限公司',0,1,18,'2023-02-28 00:00:00',6,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(54,'(2023)京0101执恢597号','',2,1,'0公司0,0公司2,0公司1','0北京鼎成典当行有限公司',0,0,7,'2023-05-07 00:00:00',6,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(55,'(2022)京0115民初16797号','',0,1,'2公司5,2公司1','1王晓彤,1滕耀霆',0,0,0,'2022-09-29 00:00:00',3,'0',NULL,'','','原告购买该共有产权房后，又购买单位分房，现以不具备共有产权房购房资格为由要求退房','','2023-11-29 00:00:00',0),(56,'(2023)京0115民初4132号','',0,1,'2公司1','1北京易成市政工程有限责任公司',0,0,1,'2023-04-09 00:00:00',3,'0',NULL,'','','未办结算，原因大项目停工未办结算，欠付工程款','','2023-11-29 00:00:00',0),(57,'(2023)京0115民初14038号','',2,1,'2公司1,2公司2','1北京建工四建工程建设有限公司',0,0,1,'2023-07-31 00:00:00',3,'0',NULL,'','','未结算欠款，双方已达成结算会议纪要，因对抵房有争议，且时效即将当期，对方起诉','','2023-11-29 00:00:00',0),(58,'(2023)京0115民初12095号','',2,1,'1公司4,1公司1','2北京资产管理有限公司',0,1,7,'2023-07-11 00:00:00',6,'0',NULL,'','','/','','2023-11-29 00:00:00',0),(59,'(2023)京0101民初3580号','',0,1,'2公司4,2公司1','1北京德曼思建筑装饰工程有限公司',0,0,1,'2023-05-30 00:00:00',3,'0',NULL,'','','无争议欠款','','2023-11-29 00:00:00',0),(60,'(2023)京0115民初19703号','',0,1,'2公司1','1遵化市钟馗门业有限公司',0,0,1,'2023-10-22 00:00:00',3,'0',NULL,'','','原告为项目入户门分包商，此前因工程款欠款已起诉，并判决项目公司付款，但质保金因未到期，未支持。现质保金到期，要求给付','','2023-11-29 00:00:00',0),(61,'2023年大预民字第74006号','',0,1,'2公司1','0沈阳联阳思美广告有限公司',0,0,12,'2023-10-23 00:00:00',3,'0',NULL,'','','19年9-10月份集团营销中心集采，德恒没有合作方，列入此合同，月费5万，服务1个月，出了项目营销定位和案名推荐，但公司未确认，集团营销中心应该已解约了，又找了新的公司','','2023-11-29 00:00:00',0),(62,'2023年大预民字第76410号','',0,1,'2公司1','0师乐姣,1尹露',0,0,0,'2023-10-25 00:00:00',3,'0',NULL,'','','17.10月，原被告签订购房合同，后因迟延交房，双方21.12.6签订《和解协议 (有反诉版)》，约定 被告应于协议签订之日起10日内向原告支付 19371 元补偿金，但至今仍未付款','','2023-11-29 00:00:00',0),(63,'2023年大预民字第81756号','',0,1,'2公司1','1北京利达安富业消防工程设备有限责任公司',0,0,1,'2023-10-25 00:00:00',3,'0',NULL,'','','原被告19.3月签订消防工程合同，截止21.3.26原告按约履行，被告5.28支付进度款81万，但该汇票到期拒付','','2023-11-29 00:00:00',0),(64,'(2023)京0115民初21636号','',0,1,'2公司1','0北京军明永信物业服务评估监理有限公司',0,0,12,'2023-10-25 00:00:00',3,'0',NULL,'','','21.4.15原被告签署承接查验评估合同，约定评估完成且通过备案后10个工作日内付款，但至今未付','','2023-11-29 00:00:00',0),(65,'2023年大预民字第78707号','',0,0,'0公司7,0公司1,0公司6,0公司3','0刘锋',0,0,0,'2023-11-07 00:00:00',3,'0',NULL,'','','原告与文化盛达签署购房合同，但由德恒、浩业环宇、益万家收取款项，购房合同解约后，尚未全部退款','','2023-11-29 00:00:00',0),(66,'1','',0,0,'0公司6,0个人0,0公司1,0公司7','0刘儒易',0,0,0,'2023-12-04 00:00:00',3,'0',NULL,'','','原告与文化盛达签署购房合同，与浩业环宇签署装修合同，但由德恒收取部分购房款，但装修未施工，要求解除装修协议','','2023-11-29 00:00:00',0),(67,'(2023)京0115执8433号','',3,1,'3公司1','4张韬',0,0,0,'2023-07-11 00:00:00',0,'0',NULL,'','','逾期交付赔偿','','2023-11-29 00:00:00',0),(68,'(2023)京0115执8890号','',3,1,'3公司1','4王明胜,4姚凤艳',0,0,0,'2023-07-19 00:00:00',0,'0',NULL,'','','逾期交付赔偿','','2023-11-29 00:00:00',0),(69,'(2023)京0115执9206号','',3,1,'3公司1','4胡文文,4李彪',0,0,0,'2023-07-31 00:00:00',0,'0',NULL,'','','逾期交付赔偿','','2023-11-29 00:00:00',0),(70,'(2023)京0115执9604号','',3,1,'3公司1','4程秀全',0,0,0,'2023-08-08 00:00:00',0,'0',NULL,'','','逾期交付赔偿','','2023-11-29 00:00:00',0),(71,'(2023)京0115执9796号','',3,1,'3公司1','4贺茜,4史林',0,0,0,'2023-08-13 00:00:00',0,'0',NULL,'','','逾期交付赔偿','','2023-11-29 00:00:00',0),(72,'(2023)京0115执9830号','',3,1,'3公司1','4顾佳征,4戢潘',0,0,0,'2023-08-13 00:00:00',0,'0',NULL,'','','逾期交付赔偿','','2023-11-29 00:00:00',0),(73,'(2023)京0115执3265号','',3,1,'3公司1','4韩晓妮,4邢鹏刚',0,0,0,'2023-02-19 00:00:00',0,'0',NULL,'','','逾期交付赔偿','','2023-11-29 00:00:00',0),(74,'(2023)京0115执3384号','',3,1,'3公司1','4王占海',0,0,0,'2023-02-20 00:00:00',0,'0',NULL,'','','逾期交付赔偿','','2023-11-29 00:00:00',0),(75,'(2023)京0115执3572号','',3,1,'3公司1','4许文博',0,0,0,'2023-02-22 00:00:00',0,'0',NULL,'','','逾期交付赔偿','','2023-11-29 00:00:00',0),(76,'(2022)京0108执9093号','',0,1,'3公司1','4丝路视觉科技股份有限公司北京分公司',0,0,12,'2022-06-27 00:00:00',3,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(77,'(2021)京0115执13459号','',0,1,'3公司1','4温国云,4周祥文',0,0,0,'2022-05-31 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(78,'(2021)京0115执13458号','',0,1,'3公司1','4温国云,4周祥文',0,0,0,'2022-03-27 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(79,'(2021)京0115执13063号','',0,1,'3公司1','4刘霞,4何志刚',0,0,0,'2022-05-24 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(80,'(2022)京0115执2475号','',0,1,'3公司1','4北鹏建材集团股份有限公司',0,0,19,'2022-03-24 00:00:00',3,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(81,'(2022)京0115执3124号','',0,1,'3公司1','4于红莲,4池丰',0,0,0,'2022-08-10 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(82,'(2022)京0115执3565号','',0,1,'3公司1','4樊志强',0,0,0,'2022-06-27 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(83,'(2022)京0115执3567号','',0,1,'3公司1','4王月霞,4董云飞',0,0,0,'2022-06-16 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(84,'(2022)京0115执3569号','',0,1,'3公司1','4张颖',0,0,0,'2022-06-27 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(85,'(2022)京0115执3634号','',0,1,'3公司1','4朱建辉,4刘芳',0,0,0,'2022-06-27 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(86,'(2022)京0115执3668号','',0,1,'3公司1','4贡超毅,4姜兰',0,0,0,'2022-06-27 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(87,'(2022)京0115执3696号','',0,1,'3公司1','4赵钢,4刘畅',0,0,0,'2022-06-27 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(88,'(2022)京0115执3789号','',0,1,'3公司1','4王兵,4刘二涛',0,0,0,'2022-06-27 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(89,'(2022)京0115执3923号','',0,1,'3公司1','4刘馨宇,4田辉',0,0,0,'2022-06-21 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(90,'(2022)京0115执3957号','',0,1,'3公司1','4贾鹏星',0,0,0,'2022-08-18 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(91,'(2022)京0115执3979号','',0,1,'3公司1','4陈竞,4李达',0,0,0,'2022-06-20 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(92,'(2022)京0115执3977号','',0,1,'3公司1','4李秋桂,4于秀林',0,0,0,'2022-06-21 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(93,'(2022)京0115执4071号','',0,1,'3公司1','4安俊波,4吴亚楠',0,0,0,'2022-06-21 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(94,'(2022)京0115执4068号','',0,1,'3公司1','4方婷婷,4高歌',0,0,0,'2022-06-21 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(95,'(2022)京0115执4067号','',0,1,'3公司1','4梁帅',0,0,0,'2022-06-21 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(96,'(2022)京0115执4115号','',0,1,'3公司1','4李巧英,4谢红志',0,0,0,'2022-09-06 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(97,'(2022)京0115执4073号','',0,1,'3公司1','4宋洋',0,0,0,'2022-06-21 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(98,'(2022)京0115执4072号','',0,1,'3公司1','4石凤英,4李高勇',0,0,0,'2022-06-21 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(99,'(2022)京0115执4133号','',0,1,'3公司1','4刘海文,4陈磊',0,0,0,'2022-06-23 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(100,'(2022)京0115执4129号','',0,1,'3公司1','4王文倩,4李硕',0,0,0,'2022-06-21 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(101,'(2022)京0115执4306号','',0,1,'3公司1','4王美香,4南少杰',0,0,0,'2022-06-23 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(102,'(2022)京0115执4202号','',0,1,'3公司1','4方媛',0,0,0,'2022-06-23 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(103,'(2022)京0115执4076号','',0,1,'3公司1','4朱海兰,4王康',0,0,0,'2022-06-21 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(104,'(2022)京0115执4102号','',0,1,'3公司1','4高珊,4宋勇',0,0,0,'2022-06-21 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(105,'(2022)京0115执4312号','',0,1,'3公司1','4冯利慧,4张松涛',0,0,0,'2022-06-23 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(106,'(2022)京0115执4214号','',0,1,'3公司1','4赵乃峰,4王挪娜',0,0,0,'2022-06-23 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(107,'(2022)京0115执4392号','',0,1,'3公司1','4北京至诚兴建建筑工程有限公司',0,0,1,'2022-08-25 00:00:00',3,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(108,'(2022)京0115执4087号','',0,1,'3公司1','4景莉影,4马涛',0,0,0,'2022-06-21 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(109,'(2022)京0115执4255号','',0,1,'3公司1','4北京九华泽柏科技发展有限公司',0,0,1,'2022-08-10 00:00:00',3,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(110,'(2022)京0115执4239号','',0,1,'3公司1','4窦菲涛',0,0,0,'2022-06-23 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(111,'(2022)京0115执4296号','',0,1,'3公司1','4史海涛,4赵墨浴',0,0,0,'2022-06-23 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(112,'(2022)京0115执4432号','',0,1,'3公司1','4王玉,4成世良',0,0,0,'2022-06-23 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(113,'(2022)京0115执4490号','',0,1,'3公司1','4杨玉凤,4李永刚',0,0,0,'2022-06-23 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(114,'(2022)京0115执4516号','',0,1,'3公司1','4卢成科,4孙玮',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(115,'(2022)京0115执4507号','',0,1,'3公司1','4牛得蓂,4武娟霞',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(116,'(2022)京0115执4506号','',0,1,'3公司1','4范姗姗,4王会生',0,0,0,'2022-06-23 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(117,'(2022)京0115执4505号','',0,1,'3公司1','4栾紫明,4刘夕芳',0,0,0,'2022-06-23 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(118,'(2022)京0115执4504号','',0,1,'3公司1','4马士让,4余胜男',0,0,0,'2022-06-23 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(119,'(2022)京0115执4277号','',0,1,'3公司1','4田小川',0,0,0,'2022-06-23 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(120,'(2022)京0115执4498号','',0,1,'3公司1','4潘方圆',0,0,0,'2022-06-23 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(121,'(2022)京0115执4591号','',0,1,'3公司1','4武杨',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(122,'(2022)京0115执4808号','',0,1,'3公司1','4哈达木仁,4冯雾语',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(123,'(2022)京0115执4860号','',0,1,'3公司1','4赵艳惠,4何江龙',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(124,'(2022)京0115执4863号','',0,1,'3公司1','4马镇超,4张筱伟',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(125,'(2022)京0115执5020号','',0,1,'3公司1','4潘康,4包司奇',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(126,'(2022)京0115执5064号','',0,1,'3公司1','4段乙好,4叶秋虹',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(127,'(2022)京0115执5262号','',0,1,'3公司1','4刘英杰,4刘青松',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(128,'(2022)京0115执5367号','',0,1,'3公司1','4杨征',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(129,'(2022)京0115执5466号','',0,1,'3公司1','4于淼,4康有成',0,0,0,'2022-06-21 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(130,'(2022)京0115执5469号','',0,1,'3公司1','4北京海运德金属材料有限公司',0,0,19,'2022-08-08 00:00:00',3,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(131,'(2022)京0115执5506号','',0,1,'3公司1','4高濛,4王原宁',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(132,'(2022)京0115执5643号','',0,1,'3公司1','4刘文韬,4肖霞',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(133,'(2022)京0115执5731号','',0,1,'3公司1','4沙禹含,4杨潇',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(134,'(2022)京0115执5723号','',0,1,'3公司1','4北京市山之田模型设计有限公司',0,0,12,'2022-08-14 00:00:00',3,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(135,'(2022)京0115执5914号','',0,1,'3公司1','4朱晓峰,4张蕾',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(136,'(2022)京0115执5959号','',0,1,'3公司1','4北京华商电力设备有限公司',0,0,0,'2022-08-10 00:00:00',3,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(137,'(2022)京0115执6013号','',0,1,'3公司1','4陈海姣,4王文敬',0,0,0,'2022-06-26 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(138,'(2022)京0115执7707号','',0,1,'3公司1','4蔡宜珍,4邱京川',0,0,0,'2022-09-19 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(139,'(2022)京0115执7785号','',0,1,'3公司1','4李宇,4王婉青',0,0,0,'2022-09-18 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(140,'(2022)京0115执7718号','',0,1,'3公司1','4孟玥',0,0,0,'2022-11-18 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0),(141,'(2022)京0115执7971号','',0,1,'3公司1','4柏孟雪,4李天啸',0,0,0,'2022-09-18 00:00:00',0,'0',NULL,'','',NULL,'','2023-11-29 00:00:00',0);

/*Table structure for table `corporate_companies` */

DROP TABLE IF EXISTS `corporate_companies`;

CREATE TABLE `corporate_companies` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `region` varchar(255) DEFAULT NULL,
  `descriptions` varchar(255) DEFAULT NULL,
  `isInactived` tinyint(1) DEFAULT 0,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `corporate_companies` */

insert  into `corporate_companies`(`id`,`name`,`address`,`region`,`descriptions`,`isInactived`) values (0,'国瑞兴业建筑工程设计有限公司',NULL,'北京',NULL,0),(1,'国瑞德恒房地产开发有限公司',NULL,'北京',NULL,0),(2,'国瑞兴业地产股份有限公司',NULL,'北京',NULL,0),(3,'益万家文化传播有限公司',NULL,'北京',NULL,0),(4,'国瑞兴业健康科技有限公司',NULL,'北京',NULL,0),(5,'大兴区保障性住房建设投资有限公司',NULL,'北京',NULL,0),(6,'浩业环宇装饰工程有限公司',NULL,'北京',NULL,0),(7,'文华盛达房地产开发有限公司',NULL,'北京',NULL,0);

/*Table structure for table `corporate_partners` */

DROP TABLE IF EXISTS `corporate_partners`;

CREATE TABLE `corporate_partners` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `contact` varchar(255) DEFAULT NULL,
  `descriptions` varchar(255) DEFAULT NULL,
  `isInactived` tinyint(1) DEFAULT 0,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `corporate_partners` */

insert  into `corporate_partners`(`id`,`name`,`contact`,`descriptions`,`isInactived`) values (0,'张丽佳',NULL,NULL,0),(1,'李立',NULL,NULL,0),(2,'郑智',NULL,NULL,0);

/*Table structure for table `counsel_titles` */

DROP TABLE IF EXISTS `counsel_titles`;

CREATE TABLE `counsel_titles` (
  `id` int(11) NOT NULL,
  `label` varchar(255) DEFAULT NULL,
  `descriptions` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `counsel_titles` */

insert  into `counsel_titles`(`id`,`label`,`descriptions`) values (0,'无',NULL),(1,'其他',NULL),(2,'书记员',NULL),(3,'法官',NULL);

/*Table structure for table `law_firms` */

DROP TABLE IF EXISTS `law_firms`;

CREATE TABLE `law_firms` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `contact` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `descriptions` varchar(255) DEFAULT NULL,
  `isInactived` tinyint(1) DEFAULT 0,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `law_firms` */

insert  into `law_firms`(`id`,`name`,`contact`,`address`,`descriptions`,`isInactived`) values (0,'无',NULL,NULL,NULL,0),(1,'君合',NULL,NULL,NULL,0),(2,'白朗',NULL,NULL,NULL,0);

/*Table structure for table `legal_agencies` */

DROP TABLE IF EXISTS `legal_agencies`;

CREATE TABLE `legal_agencies` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `contact` varchar(255) DEFAULT NULL,
  `authLevel` int(11) NOT NULL DEFAULT 0,
  `descriptions` varchar(255) DEFAULT NULL,
  `isInactived` tinyint(1) DEFAULT 0,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `legal_agencies` */

insert  into `legal_agencies`(`id`,`name`,`contact`,`authLevel`,`descriptions`,`isInactived`) values (0,'无',NULL,1,NULL,0),(1,'贺璐璐',NULL,1,NULL,0),(2,'李俊峰',NULL,0,NULL,0),(3,'王培斯',NULL,0,NULL,0);

/*Table structure for table `legal_counsels` */

DROP TABLE IF EXISTS `legal_counsels`;

CREATE TABLE `legal_counsels` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `contact` varchar(255) DEFAULT NULL,
  `title` int(11) NOT NULL DEFAULT 0,
  `institution` int(11) NOT NULL DEFAULT 0,
  `descriptions` varchar(255) DEFAULT NULL,
  `isInactived` tinyint(1) DEFAULT 0,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `legal_counsels` */

insert  into `legal_counsels`(`id`,`name`,`contact`,`title`,`institution`,`descriptions`,`isInactived`) values (0,'无','',0,0,NULL,0),(1,'李新亮','57362323',3,1,NULL,0),(2,'郭艳','57362676',3,1,NULL,0),(3,'张振','57362300',1,2,NULL,0),(4,'张东莹','57362564',2,1,NULL,0),(5,'郑少杰','57362579',2,1,NULL,0),(6,'高新宇','57362335',1,1,NULL,0);

/*Table structure for table `legal_institution` */

DROP TABLE IF EXISTS `legal_institution`;

CREATE TABLE `legal_institution` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `contact` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `descriptions` varchar(255) DEFAULT NULL,
  `isInactived` tinyint(1) DEFAULT 0,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `legal_institution` */

insert  into `legal_institution`(`id`,`name`,`contact`,`address`,`descriptions`,`isInactived`) values (0,'无',NULL,NULL,NULL,0),(1,'大兴法院',NULL,NULL,NULL,0),(2,'东城法院',NULL,NULL,NULL,0);

/*Table structure for table `names` */

DROP TABLE IF EXISTS `names`;

CREATE TABLE `names` (
  `id` int(60) NOT NULL,
  `user` varchar(100) NOT NULL,
  `pass` varchar(100) NOT NULL,
  `name` varchar(100) DEFAULT NULL,
  `position` int(11) NOT NULL,
  `level` int(1) NOT NULL DEFAULT 3,
  `createDate` datetime NOT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE KEY `user` (`user`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `names` */

insert  into `names`(`id`,`user`,`pass`,`name`,`position`,`level`,`createDate`) values (8,'jadeyao','1555','Luke',1,4,'2023-11-11 14:03:19'),(9,'jimmy','1555','Jimmy',1,4,'2023-11-12 14:25:28'),(10,'luke','1555',NULL,1,4,'2023-11-13 16:56:44');

/*Table structure for table `projects` */

DROP TABLE IF EXISTS `projects`;

CREATE TABLE `projects` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `region` varchar(255) DEFAULT NULL,
  `descriptions` varchar(255) DEFAULT NULL,
  `isInactived` tinyint(1) DEFAULT 0,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `projects` */

insert  into `projects`(`id`,`name`,`address`,`region`,`descriptions`,`isInactived`) values (0,'北七家',NULL,NULL,NULL,0),(1,'大兴',NULL,NULL,NULL,0);

/*Table structure for table `property_status` */

DROP TABLE IF EXISTS `property_status`;

CREATE TABLE `property_status` (
  `id` int(11) NOT NULL,
  `label` varchar(255) DEFAULT NULL,
  `descriptions` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

/*Data for the table `property_status` */

insert  into `property_status`(`id`,`label`,`descriptions`) values (0,'查封',NULL),(1,'冻结',NULL);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
